app/Models/DosenModel.php

    public function addDosen($data)
    {
        return $this->insert($data);
---
INSERT INTO `dosen` (`nama`, `matakuliah`, `email`) VALUES ('alek', 'kkpi', 'alek@gmail.com')